<?php
$arr = [

    'battle start' => [
        ['В бой'],
        ['Прокрасться']
    ],
    'battle step' => [
        ['Атака', 'Зелья'],
        [''],
        ['Рубящий', 'Сбежать']
    ],
    'inspect' => [
        ['Осмотреть'],
    ],
    'lvl up' => [
        ['Спуститься'],
        ['Остаться']
    ],
    'find event' => [
        ['Исследовать уровень'],
        ['Наверх', 'Глубже', 'В портал'],
        ['Персонаж', 'Отдых'],
    ],
    'inspect quickly' => [
        ['Обыскать']
    ],
    'mini loot' => [
        ['Собрать']
    ],
    'small eat' => [
        ['Собрать']
    ],
    'trap not work' => [ // ловушка
        ['Продолжить']
    ],
    'trap work' => [
        ['Освободиться']
    ],
    'roulette skill' => [
        ['Бросить кости']
        ['Уйти']
    ],
    'open door force' => [
        ['Открыть силой']
        ['Уйти']
    ],
    'sell trophy' => [
        ['Продать трофеи']
        ['Уйти']
    ],
];

$fp = fopen('btn.json', 'w');
fwrite($fp, json_encode($arr));
fclose($fp);